Dennis-van-Gils/DvG_Arduino_lock-in_amp/source_Atmel_Studio/project_LIA_SAMD21/LIA_SAMD21/main.c
    TIMER_0.time = 0;

    // DAC
    dac_async_write(&DAC_0, 0, LUT_wave, N_LUT);

    // ADC
    adc_dma_deinit(&ADC_0);
    adc_dma_init(&ADC_0, ADC);
    adc_dma_read(&ADC_0, &(TX_buffer_A[TX_BUFFER_OFFSET_SIG_I]), 2); // Even length required, not odd
    adc_dma_enable_channel(&ADC_0, 0);

    using_TX_buffer_A = true;
    is_TX_buffer_starting_up = true;
    write_time_and_phase_stamp_to_TX_buffer(TX_buffer_A);

    // Set TRIG_OUT to LOW
    gpio_set_pin_level(PIN_D0__TRIG_OUT, false);

    is_running = true;
    timer_start(&TIMER_0);
}



/*------------------------------------------------------------------------------
    Direct memory access controller (DMAC)
------------------------------------------------------------------------------*/

/*
// Snippet for the transfer done interrupt callback.
static void cb_DMA_1_transfer_done(struct _dma_resource *const resource) {
    // Clear transfer complete flag
    DMAC->CHID.bit.ID = 1;
    DMAC->CHINTENSET.bit.TCMPL = 1;

    //sprintf(str_buffer, "%8lu DMA_1_txc\n", millis);
    //usb_print(str_buffer);
}
*/

void configure_DMA_1(void) {
    // Will send out TX_buffer_A over serial
    _dma_set_source_address(1, (void *) TX_buffer_A);
    _dma_set_destination_address(1, (void *)
                                 &(((Sercom *)(USART_0.device.hw))->
                                   USART.DATA.reg));
    _dma_set_data_amount(1, (uint32_t) N_BYTES_TX_BUFFER);

    /*
    // Snippet to enable the transfer done interrupt callback. This can be
    // useful for debugging, but do not leave on for proper operation as it
    // seems to mess with tight timing and screws the event order around,
    // somehow.
    struct _dma_resource *dma_res;

    // Get DMA channel 1 resource to set the application callback
    _dma_get_channel_resource(&dma_res, 1);

    // Set application callback to handle the DMA channel 1 transfer done
    dma_res->dma_cb.transfer_done = cb_DMA_1_transfer_done;

    // Enable DMA channel 1 transfer complete interrupt
    _dma_set_irq_state(1, DMA_TRANSFER_COMPLETE_CB, true);
    */
}

void configure_DMA_2(void) {
    // Will send out TX_buffer_B over serial
    _dma_set_source_address(2, (void *) TX_buffer_B);
    _dma_set_destination_address(2, (void *)
                                 &(((Sercom *)(USART_0.device.hw))->
                                   USART.DATA.reg));
    _dma_set_data_amount(2, (uint32_t) N_BYTES_TX_BUFFER);
}



/*------------------------------------------------------------------------------
    main
------------------------------------------------------------------------------*/

int main(void) {
    NVIC_SetPriority(TCC0_IRQn   , 0);
    NVIC_SetPriority(DAC_IRQn    , 1);
    NVIC_SetPriority(ADC_IRQn    , 1);
    NVIC_SetPriority(SERCOM5_IRQn, 2);
    NVIC_SetPriority(SysTick_IRQn, 3);
    atmel_start_init();

    // Microcontroller unit (MCU) unique identifier (uid) number
    get_mcu_uid(mcu_uid);


    // USART
    usart_async_get_io_descriptor(&USART_0, &io);
    usart_async_register_callback(&USART_0, USART_ASYNC_TXC_CB  , cb_USART_txc);
    usart_async_register_callback(&USART_0, USART_ASYNC_RXC_CB  , cb_USART_rxc);
    usart_async_register_callback(&USART_0, USART_ASYNC_ERROR_CB, cb_USART_err);
    usart_async_enable(&USART_0);

    DvG_scl scl_1;
    scl_configure(&scl_1, io);

    // Copy SOM and EOM to the transmit buffer TX_buffer
    memcpy(TX_buffer_A                         , SOM, 10);
    memcpy(TX_buffer_B                         , SOM, 10);
    memcpy(&TX_buffer_A[N_BYTES_TX_BUFFER - 10], EOM, 10);
    memcpy(&TX_buffer_B[N_BYTES_TX_BUFFER - 10], EOM, 10);

    // LUT
    double wanted_startup_ref_freq = 500; // [Hz]
    compute_LUT(LUT_wave, wanted_startup_ref_freq);

    // Will send out TX_buffer over SERCOM when triggered
    configure_DMA_1();
    configure_DMA_2();

    // Init DAC and ADC
    init_LIA();

    // Millis and micros timer
    //SysTick_Config(SystemCoreClock / 1000);
    SysTick->LOAD = (uint32_t) (SystemCoreClock / 1000 - 1UL);
    SysTick->VAL  = 0UL;
    SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk |
                    SysTick_CTRL_TICKINT_Msk   |
                    SysTick_CTRL_ENABLE_Msk;

    char *str_cmd;  // Incoming serial command string
    bool toggle = false;
    uint32_t prev_millis = millis;

    while (1) {
        if (millis - prev_millis >= 250) {
            prev_millis = millis;
            gpio_set_pin_level(PIN_D13__LED, toggle);
            toggle = !toggle;
        }

        // Process commands on the data channel
        if (is_serial_rxc) {
            is_serial_rxc = false;

            if (scl_available(&scl_1)) {

                if (is_running) {

                    // -------------------
                    //  Running
                    // -------------------

                    is_running = false;

                    // Disable DAC output
                    uint16_t DAC_OUTPUT_OFF[1] = {0};
                    dac_async_write(&DAC_0, 0, DAC_OUTPUT_OFF, 1);
                    gpio_set_pin_level(PIN_D0__TRIG_OUT, false);

                    // Cancel all active DMA transactions
                    CRITICAL_SECTION_ENTER();
                    DMAC->CHID.reg = DMAC_CHID_ID(0);   // ADC
                    DMAC->CHCTRLA.reg = 0;
                    DMAC->CHID.reg = DMAC_CHID_ID(1);   // SERCOM TX_buffer_A
                    DMAC->CHCTRLA.reg = 0;
                    DMAC->CHID.reg = DMAC_CHID_ID(2);   // SERCOM TX_buffer_B
                    DMAC->CHCTRLA.reg = 0;
                    CRITICAL_SECTION_LEAVE();

                    // Confirm at the PC side that the lock-in amp is off and is
                    // no longer sending binary data. The 'off' message might
                    // still be preceded with some left-over binary data when
                    // being read at the PC side.
                    //io_write(io, (uint8_t *) "\noff\n", 5);  // non-blocking
                    io_print("\noff\n");

                    // Flush out and ignore the command
                    scl_get_command(&scl_1);

                } else {

                    // -------------------
                    //  Not running
                    // -------------------

                    str_cmd = scl_get_command(&scl_1);

                    if (strcmp(str_cmd, "id?") == 0) {
                        // Report identity string
                        io_print("Arduino lock-in amp\n");

                    } else if (strcmp(str_cmd, "mcu?") == 0) {
                        // Report microcontroller model, serial and firmware
                        char str_model[12];
                        char str_uid[9];

                        snprintf(str_model, sizeof(str_model),
                                 #if defined(__SAMD21G18A__)
                                 "SAMD21G18A"
                                 #elif defined(__SAMD21E18A__)
                                 "SAMD21E18A"
                                 #elif defined(__SAMD51P20A__)
                                 "SAMD51P20A"
                                 #elif defined(__SAMD51J19A__)
                                 "SAMD51J19A"
                                 #elif defined(__SAMD51G19A__)
                                 "SAMD51G19A"
                                 #else
                                 "unknown MCU"
                                 #endif
                                 );
                        format_byte_array_as_hex8string(str_uid,
                                                        sizeof(str_uid),
                                                        mcu_uid);
                        snprintf(str_buffer, MAXLEN_STR_BUFFER, "%s\t%s\t%s\n",
                                 FIRMWARE_VERSION, str_model, str_uid);
                        io_print(str_buffer);

                    } else if (strcmp(str_cmd, "const?") == 0) {
                        // Report constants
                        snprintf(str_buffer, MAXLEN_STR_BUFFER,
                                 "%.6f\t%u\t%u\t%u\t%u\t%.3f\t%u\t%u\n",
                                 SAMPLING_PERIOD_us,
                                 BLOCK_SIZE,
                                 N_BYTES_TX_BUFFER,
                                 DAC_OUTPUT_BITS,
                                 ADC_INPUT_BITS,
                                 A_REF,
                                 MIN_N_LUT,
                                 MAX_N_LUT);
                        io_print(str_buffer);

                    } else if (strcmp(str_cmd, "ref?") == 0 ||
                               strcmp(str_cmd, "?") == 0) {
                        // Report reference signal settings
                        snprintf(str_buffer, MAXLEN_STR_BUFFER,
                                 "%u\t%u\t%.3f\t%.3f\t%.3f\n",
                                 N_LUT,
                                 ref_type,
                                 ref_V_offset,
                                 ref_V_ampl,
                                 ref_freq);
                        io_print(str_buffer);

                    } else if (strcmp(str_cmd, "lut_ascii?") == 0) {
                        // Report the full LUT as ASCII, tab delimited
                        // Slow but handy for debugging
                        for (uint16_t i = 0; i < N_LUT - 1; i++) {
                            sprintf(str_buffer, "%u\t", LUT_wave[i]);
                            io_print(str_buffer);
                        }
                        sprintf(str_buffer, "%u\n", LUT_wave[N_LUT - 1]);
                        io_print(str_buffer);

