Dennis-van-Gils/DvG_Arduino_lock-in_amp/source_Atmel_Studio/project_LIA_SAMD21/LIA_SAMD21/main.c
                    } else if (strcmp(str_cmd, "lut?") == 0) {
                        // Report the full LUT as a binary stream
                        io_write_blocking((uint8_t *) &N_LUT, 2);
                        io_write_blocking((uint8_t *) LUT_wave, N_LUT * 2);
                        io_print("\n");

                    } else if (strcmp(str_cmd, "time?") == 0) {
                        // Report time in microseconds
                        io_print_timestamp();

                    } else if (strcmp(str_cmd, "off") == 0) {
                        // Lock-in amp is already off and we reply with an
                        // acknowledgment
                        io_print("already_off\n");

                    } else if (strcmp(str_cmd, "on") == 0) {
                        // Start lock-in amp
                        start_LIA();

                    } else if (strncmp(str_cmd, "freq", 4) == 0) {
                        // Set frequency of reference signal [Hz]
                        // And reply with the obtained frequency [Hz]
                        compute_LUT(LUT_wave, atof(&str_cmd[4]));
                        snprintf(str_buffer, MAXLEN_STR_BUFFER,
                                 "%.3f\n", ref_freq);
                        io_print(str_buffer);

                    } else if (strncmp(str_cmd, "offs", 4) == 0) {
                        // Set offset of reference signal [V]
                        // And reply with the obtained offset [V]
                        ref_V_offset = atof(&str_cmd[4]);
                        ref_V_offset = max(ref_V_offset, 0.0);
                        ref_V_offset = min(ref_V_offset, A_REF);
                        compute_LUT(LUT_wave, ref_freq);
                        snprintf(str_buffer, MAXLEN_STR_BUFFER,
                                 "%.3f\n", ref_V_offset);
                        io_print(str_buffer);

                    } else if (strncmp(str_cmd, "ampl", 4) == 0) {
                        // Set amplitude of reference signal [V]
                        // And reply with the obtained amplitude [V]
                        ref_V_ampl = atof(&str_cmd[4]);
                        ref_V_ampl = max(ref_V_ampl, 0.0);
                        ref_V_ampl = min(ref_V_ampl, A_REF);
                        compute_LUT(LUT_wave, ref_freq);
                        snprintf(str_buffer, MAXLEN_STR_BUFFER,
                                 "%.3f\n", ref_V_ampl);
                        io_print(str_buffer);

                    } else if (strcmp(str_cmd, "cos") == 0) {
                        ref_type = Cosine;
                        compute_LUT(LUT_wave, ref_freq);

                    } else if (strcmp(str_cmd, "sqr") == 0) {
                        ref_type = Square;
                        compute_LUT(LUT_wave, ref_freq);

                    } else if (strcmp(str_cmd, "saw") == 0) {
                        ref_type = Sawtooth;
                        compute_LUT(LUT_wave, ref_freq);

                    } else if (strcmp(str_cmd, "tri") == 0) {
                        ref_type = Triangle;
                        compute_LUT(LUT_wave, ref_freq);

                    } else if (strcmp(str_cmd, "ecg") == 0) {
                        ref_type = ECG;
                        compute_LUT(LUT_wave, ref_freq);
                    }
                }
            }
        }
    }
}
